# Найдите сумму цифр трехзначного числа.
# Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

j = int(input('Введите число '))
n = j
sum = 0
while j > 0 :
    i = j%10
    sum = sum +i
    j = j//10
print(f'Сумма цифр числа {n} = {sum}')


